# Создать словарь solar_system и заполнить его данными по планетам. В качестве ключа используйте
# название планеты, в качестве значения - расстояние от солнца.


def flight():
    planets_km = {
        "Меркурий": 57909050,
        "Венера": 107478692,
        "Земля": 149597870,
        "Марс": 227939135,
        "Юпитер": 778547796,
        "Сатурн": 1433529557,
        "Уран": 2867018561,
        "Нептун": 4495062770
    }

    for k, v in planets_km.items():
        print(f" from planet {k} flight to sun: {v} km")


flight()


#3. Выполните предыдущее задание только с выводом планет по алфавиту.


def alphabet():
    planets = {
        "Меркурий": 57909050,
        "Венера": 107478692,
        "Земля": 149597870,
        "Марс": 227939135,
        "Юпитер": 778547796,
        "Сатурн": 1433529557,
        "Уран": 2867018561,
        "Нептун": 4495062770
    }

    sorted_items = sorted(planets.items())

    for key, value in sorted_items:
        print(key, value)


alphabet()


#4. Выполните второе задание с выводом планет по возрастанию расстояния от солнца.


def km():

    planets_1 = {
        "Меркурий": 57909050,
        "Венера": 107478692,
        "Земля": 149597870,
        "Марс": 227939135,
        "Юпитер": 778547796,
        "Сатурн": 1433529557,
        "Уран": 2867018561,
        "Нептун": 4495062770
    }

    sorted_planets = sorted(planets_1.items(), key=lambda x: x[1])

    for planet, distance in sorted_planets:
        print(f"{planet}: {distance} млн км")

    #print(sorted_planets)


km()

# 5. Напишите метод, который выводит информацию о случайной планете.


import random


def rand():
    planets_2 = {
        "Меркурий": 57909050,
        "Венера": 107478692,
        "Земля": 149597870,
        "Марс": 227939135,
        "Юпитер": 778547796,
        "Сатурн": 1433529557,
        "Уран": 2867018561,
        "Нептун": 4495062770
    }

    rand_planet = random.choice(list(planets_2.items()))
    print(rand_planet)


rand()
